23-rails-auth/trainshop/app/controllers/trains_controller.rb

  def index
    @trains = Train.all
---
SELECT "trains".* FROM "trains"

  def create
    @train = Train.new(train_params)
    if @train.valid?
      @train.save
---
INSERT INTO "trains" ("name", "price", "created_at", "updated_at", "conductor_id") VALUES (?, ?, ?, ?, ?)  [["name", "the rain train"], ["price", 3], ["created_at", "2019-02-04 11:50:04.404168"], ["updated_at", "2019-02-04 11:50:04.404168"], ["conductor_id", 3]]

  def update
    @train.update(train_params)
---
UPDATE "trains" SET "name" = ?, "conductor_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["name", "Gravy Train666"], ["conductor_id", 5], ["updated_at", "2019-02-05 11:59:20.903894"], ["id", 2]]

  def destroy
    @train.destroy
---
DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 8]]

  def find_train
    @train = Train.find(params[:id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def find_conductors
    @conductors = Conductor.all
---
SELECT "conductors".* FROM "conductors"