23-rails-auth/trainshop/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "rob"], ["password_digest", "$2a$10$77nQEk1NDtMTtGFhtwPw3.TuC1uyGAudm5lj/c3vLJaUv6SaflViG"], ["created_at", "2019-05-29 13:45:49.245663"], ["updated_at", "2019-05-29 13:45:49.245663"]]

  def show
    authorized?
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]